import type { BaseTranslation } from '../i18n-types';

const en: BaseTranslation = {
	title: 'مجموعة الخولي',
	generals: {
		more: 'المــزيد',
		less: 'إخفـــاء',
		visit: 'زيارة موقعنا'
	},
	nav: {
		welcomeMsg: 'مرحـباً بكم في مجموعة الخولي',
		links: {
			home: 'الرئيسية',
			about: 'عن المجموعة',
			divisions: 'الأقســام',
			companies: 'الشركـات',
			projects: 'مشاريعنـا',
			partners: 'الشركــاء',
			contactUs: 'تواصل معنا'
		}
	},
	hero: {
		build: 'نبنــــي.',
		optimize: 'نطــــور.',
		connect: 'نتواصــل.',
		more: 'إعرف المزيد'
	},
	home: {
		aboutSection: {
			about: 'عن الشركة',
			vision: 'رؤيتنا',
			mission: 'مهمتنا'
		},
		intro: {
			manpower: 'مجموع القوّة العاملة',
			founded: 'شركة أسّستها المجموعة',
			saudiEmployees: 'موظـف سعودي'
		},
		services: {
			title: 'خدماتنا',
			p0: 'تقدّم مجموعة الخولي مجموعة شاملة من الخدمات، والتي تلبي كافة احتياجات عملائنا في المملكة وخارجها:',
			li1: '1- خدمات البناء',
			li2: '2- إنترنت الأشياء',
			li3: '3- إدارة المرافق',
			p1: 'نوفّر خدمات بناء شاملة للمشاريع المختلفة، حيث يستطيع الفريق الهندسي لدينا أن يلبي كافة متطلّبات هذا المجال، فهو يتمتّع بالكفاءة والخبرة والجودة، كما أن فريقنا يقوم بتسليم المشاريع في الوقت المحدّد وفي حدود الميزانيّة؛ لضمان تحقيق رؤيتك، تشمل هذه الخدمات المصاعد والسلالم المتحرّكة وتركيب نظام الأرفف.',
			p2: 'في مجموعة الخولي نلتزم بالاستدامة والإشراف البيئي ونقدّم أحدث تقنيات إنترنت الأشياء وذلك للتحكم الشامل والتحسين، وإنشاء الطاقة الكهروضوئيّة وطاقة الرياح، ومراقبة الطائرات بدون طيار والدراجات الإلكترونيّة، إضافة إلى حلول تحديث الطاقة، وكل هذه الأشياء مصمّمة من أجل زيادة كفاءة الأعمال وتقليل البصمة الكربونيّة.',
			p3: 'صمّمت هذه الخدمة لضمان تشغيل منشأتك بأعلى أداء، فمن الإدارة والاستشارات إلى الصيانة والعمليات، ومن الخدمات الصلبة المتخصّصة إلى الخدمات الليّنة، يقوم فريقنا بتقديم الحلول الشاملة المصمّمة خصيصًا لتلبية احتياجاتك الخاصة.'
		},
		atAlkholi: {
			title: 'في مجموعة الخولي',
			q1: 'ماذا تتوقع منا؟',
			p1: 'كمؤسّسة راسخة وذات سمعة طيّبة وخبرة تصل إلى عشرات السنوات، تلتزم مجموعة الخولي بتقديم خدمات استثنائيّة لعملائها وشركاء نجاحها، فمجرّد أن تدخل في شراكة معنا، يمكنك أن تتوقّع:',
			p2: 'الاحتراف والخبرة: فريقنا المتخصّص والمحترف يعمل بدقّة وعناية كي يجلب لمشروعك كل معاني النجاح والازدهار؛ مما يضمن تلبية جميع احتياجاتك.',
			p3: 'حلول مخصّصة: يتفهم فريقنا بأن لكل شريك نجاح احتياجاته الخاصة، لذلك يقدّم حلولًا متخصّصة ومصمّمة خصيصًا لمتطلباتك الخاصة.',
			p4: 'الجودة والكفاءة: يتجلّى التزامنا بالجودة في كل جانب من جوانب أعمالنا، ونسعى بكل قدراتنا أن نقدّم حلولًا فعّالة تتغلّب على التحدّيات وتلبي كافة التطلّعات.',
			p5: 'الشفافية والتواصل: نعتقد أن التواصل المفتوح هو المفتاح لبناء علاقات قويّة ودائمة مع عملائنا، لذلك يمكنك توقّع الشفافية والتواصل الواضح من فريقنا في جميع الأوقات.',
			p6: 'الموثوقيّة والجدارة بالثقة: في مجموعة الخولي نلتزم بكسب ثقتك وبناء سمعة طيّبة، لذلك يمكنك الاعتماد علينا في كل متطلّباتك الصناعيّة.'
		},
		projects: {
			title: 'أعمالـنا السابقة'
		},
		testimonials: {
			title: 'آراء العــملاء'
		},
		companies: {
			title: 'شـــركاتنا'
		}
	},
	divisions: {
		title: 'أقسام المجموعة'
	},
	about: {
		aboutSection: {
			about: 'عن الشركة',
			story: 'قصتنا',
			values: 'قيمنا'
		},
		timeline: {
			title: 'الخط الزمني',
			p1: 'تستمر مجموعة الخولي في النمو والتوسّع، محافظة على تميّزها الذي يعكس جدولها الزمني، فهي تعتبر مزوّدًا رائدًا للحلول المبتكرة وذلك عبر مجموعة من الصناعات المختلفة، فمن بداية انطلاق المجموعة وحتى اليوم وهي تهدف أن تصبح الشريك الأفضل للكثير من القطاعات، والعضو الفعّال في مجتمع الأعمال السعودي.'
		},
		missionVision: {
			missionT: 'مهمتنا',
			missionP: 'تمكين شركاء النجاح من خلال تقديم الحلول المبتكرة للمشاريع المختلفة.',
			visionT: 'رؤيتنا',
			visionP: 'الابتكار والتفوّق في الصناعات المختلفة مع الحفاظ على أعلى درجات الجودة.'
		},
		team: {
			title: 'تعرف على الفـريق'
		},
		partners: {
			title: 'شركاء النجاح',
			p1: 'تشرفنا بالكثير من الشراكات القويّة مع مجموعة من الشركات المرموقة في جميع أنحاء المملكة، من هذه الشركات:'
		}
	},
	companies: {
		title: 'شركاتنــا',
		amos: 'وهي شركة تُعنى بإدارة المرافق، تقدم مجموعة من الخدمات بما في ذلك الخدمات الصلبة المتخصّصة، وإدارة مرافق الحدائق الطبيعيّة، لتلبي كافة أهداف العملاء برؤية شاملة ومبتكرة.',
		sbtmc:
			'شركة فن المعمار للصيانة المحدودة متخصصة في تقديم خدمات البناء والهندسة الميكانيكية والكهربائية وإدارة المشاريع وإدارة المرافق. تعتبر الشركة 100٪ سعودية وتضم إدارة وقوى عمل من جنسيات مختلفة. تقدم الشركة مجموعة متكاملة من الخدمات المتخصصة التي تعكس المستوى الراقي والمتقدم لتصميم المرافق في المملكة.',
		upmoc:
			'وهي شركة تتخصّص في الصيانة الميكانيكيّة والكهربائيّة والسباكة، تقدم مجموعة كاملة من الخدمات بما في ذلك خدمات التشغيل والصيانة والبناء والاتصالات، لديها الفريق الموهوب والخبير الذي يقدّم تصاميمه الراقية بنظرة متقدّمة جعلت من هذه التصاميم الخيار الأول للكثير من الجهات في المملكة.',
		bteco:
			'تتخصّص الشركة في المصاعد والسلالم المتحركة والمصاعد الثقيلة، وقد صمّمت هذه الخدمات التي تتسم بالكفاءة والجودة والفعالية؛ لتلبي متطلبات المجتمعات العصريّة.',
		aktek:
			'توفّر الشركة التصنيع المسبق للهندسة الكهربائيّة والميكانيكيّة داخل الموقع أو خارجه، وتقدّم حلولاً مبتكرة ومصمّمة لتخفّض من التكاليف وتحقّق أقصى قدر من الكفاءة.',
		akstra:
			'تتخصّص الشركة في الاستشارات وتقدّم خبرتها التعليميّة والتجريبيّة، لتحقّق نتائج طويلة الأمد، تستجيب لكافة طلبات العملاء.',
		tech: 'جاءت هذه الشركة لتساعد الصناعات المختلفة على إعادة تصوّر أعمالها حتى تتماشى أكثر مع العصر الرقمي، وتركّز على تحقيق الابتكار وتقدم خدمات تكنولوجيّة باستطاعتها أن تلبي كافة الأهداف الصناعيّة للعملاء.',
		trading:
			'توفّر الشركة حلول التخزين الميكانيكي والتخزين الثابت والتخزين الآلي لمجموعة من الصناعات المتعدّدة، وقد صمّمت خدماتها لخفض التكاليف وتحقيق أقصى قدر من التميّز والنمو.',
		hcare:
			'هي المزوّد البارز لخدمات الرعاية الصحيّة في المملكة، تأسست عام 1993م بهدف توفير مجموعة من الخدمات الطبيّة والصيدلانيّة، من خلال كوادرها المهنية المتخصصة، وتدير العديد من العيادات والمستشفيات في جميع أنحاء المملكة، وتشتهر بتقديم خدمات الرعاية الصحيّة عالية الجودة لجميع الأشخاص.'
	},
	projects: {
		title: 'أعمالنــا السابقة',
		all: 'الــكل',
		education: 'التعليم',
		construction: 'البنـــاء',
		healthcare: 'الرعاية الصحية',
		hospitality: 'الضيــافة',
		government: 'الأعمال الحكومية'
	},
	partners: {
		title: 'شركاء النجاح',
		t1: 'الشركاء الحكوميين',
		t2: 'مؤسسات التغذية'
	},
	contact: {
		title1: 'تواصــل',
		title2: 'معنــــــا',
		phone: 'الهاتف',
		phone1: '966114041919+',
		phone2: '966114022426+',
		location: 'المــوقع',
		addressPart1: '3821-3847 شارع زبيدة بنت جعفر',
		addressPart2: 'حي المربع، الرياض',
		email: 'البريد الإلكتروني',
		emailAddress: 'info@alkholi.com'
	},
	form: {
		fullName: 'الإسم بالكامل*',
		fullNameError: 'الإسم يجب أن يكون أكثر من حرفين!',
		fullNameLengthError: 'الحد الأقصى للإسم 60 حرف!',
		fullNameNumericError: 'غير مسموح بالأرقام!',
		fullNamePlaceholder: 'أدخل اسمك هنا ...',
		emailError: 'من فضلك أدخل ايميل صحيح!',
		emailPlaceholder: 'البريد الإلكتروني*',
		mobilePlaceholder: 'رقم الجوال (05xxxxxxxx)',
		mobileError: 'من فضلك أدخل رقم جوال صحيح!',
		typeOfProject: 'نوع المشروع',
		textAreaPlaceholder: 'رسالتك هنا ...',
		textAreaError1: 'رسالتك قصيرة للغاية!',
		textAreaError2: 'الحد الأقصى للرسالة 500 حرف!',
		submit: 'إرســـال',
		successFeedback: 'شكراً لك!',
		errorFeedback: 'حدث خطأ ما!',
		conditions: 'أوافق على الشروط والأحكام'
	},
	joinUsForm: {
		title: 'تريد الإنضمام لفريقــنا؟',
		fullName: 'الإسم بالكامل*',
		fullNameError: 'الإسم يجب أن يكون أكثر من حرفين!',
		fullNameLengthError: 'الحد الأقصى للإسم 60 حرف!',
		fullNameNumericError: 'غير مسموح بالأرقام!',
		fullNamePlaceholder: 'أدخل اسمك هنا ...',
		emailError: 'من فضلك أدخل ايميل صحيح!',
		emailPlaceholder: 'البريد الإلكتروني*',
		mobilePlaceholder: 'رقم الجوال (05xxxxxxxx)',
		mobileError: 'من فضلك أدخل رقم جوال صحيح!',
		positionPlaceholder: 'إختار القسم ...',
		position1: 'عمليات التشغيل',
		position2: 'المبيعات',
		position3: 'الموارد البشرية',
		position4: 'نظم المعلومات',
		position5: 'الحسابات',
		position6: 'فني',
		position7: 'عامل',
		position8: 'أخرى',
		resumeAttachment: 'إرفاق السيرة الذاتية ...',
		typeOfProject: 'نوع المشروع',
		textAreaPlaceholder: 'رسالتك هنا ...',
		textAreaError1: 'رسالتك قصيرة للغاية!',
		textAreaError2: 'الحد الأقصى للرسالة 500 حرف!',
		submit: 'إرســـال',
		successFeedback: 'شكراً لك!',
		errorFeedback: 'حدث خطأ ما!',
		conditions: 'أوافق على الشروط والأحكام'
	}
};

export default en;
