import type { BaseTranslation } from '../i18n-types';

const en: BaseTranslation = {
	title: 'مجموعة الخولي',
	generals: {
		more: 'المــزيد'
	},
	nav: {
		welcomeMsg: 'مرحـباً بكم في مجموعة الخولي',
		links: {
			home: 'الرئيسية',
			about: 'عن المجموعة',
			divisions: 'الأقســام',
			companies: 'الشركـات',
			projects: 'مشاريعنـا',
			partners: 'الشركــاء',
			contactUs: 'تواصل معنا'
		}
	},
	hero: {
		build: 'نَبنــــي.',
		optimize: 'نُطــــور.',
		connect: 'نتواصــل.',
		more: 'إعرف المزيد'
	},
	home: {
		aboutSection: {
			about: 'عن الشركة',
			vision: 'رؤيتنا',
			mission: 'مهمتنا'
		},
		intro: {
			manpower: 'مجموع القوّة العاملة',
			founded: 'شركة أسّستها المجموعة',
			saudiEmployees: 'موظـف سعودي'
		},
		services: {
			title: 'خدماتنا',
			p1: 'تقدّم مجموعة الخولي مجموعة شاملة من الخدمات، والتي تلبي كافة احتياجات عملائنا في المملكة وخارجها:',
			li1: '1- خدمات البناء',
			li2: '2- إنترنت الأشياء',
			li3: '3- إدارة المرافق'
		},
		atAlkholi: {
			title: 'في مجموعة الخولي',
			q1: 'ماذا تتوقع منا؟',
			p1: 'كمؤسّسة راسخة وذات سمعة طيّبة وخبرة تصل إلى عشرات السنوات، تلتزم مجموعة الخولي بتقديم خدمات استثنائيّة لعملائها وشركاء نجاحها، فمجرّد أن تدخل في شراكة معنا، يمكنك أن تتوقّع:',
			p2: 'الاحتراف والخبرة: فريقنا المتخصّص والمحترف يعمل بدقّة وعناية كي يجلب لمشروعك كل معاني النجاح والازدهار؛ مما يضمن تلبية جميع احتياجاتك.'
		}
	},
	about: {
		aboutSection: {
			about: 'عن الشركة',
			story: 'قصتنا',
			values: 'قيمنا'
		},
		timeline: {
			title: 'الخط الزمني',
			p1: 'تستمر مجموعة الخولي في النمو والتوسّع، محافظة على تميّزها الذي يعكس جدولها الزمني، فهي تعتبر مزوّدًا رائدًا للحلول المبتكرة وذلك عبر مجموعة من الصناعات المختلفة، فمن بداية انطلاق المجموعة وحتى اليوم وهي تهدف أن تصبح الشريك الأفضل للكثير من القطاعات، والعضو الفعّال في مجتمع الأعمال السعودي.'
		},
		missionVision: {
			missionT: 'مهمتنا',
			missionP: 'تمكين شركاء النجاح من خلال تقديم الحلول المبتكرة للمشاريع المختلفة.',
			visionT: 'رؤيتنا',
			visionP: 'الابتكار والتفوّق في الصناعات المختلفة مع الحفاظ على أعلى درجات الجودة.'
		},
		team: {
			title: 'تعرف على الفـريق'
		},
		partners: {
			title: 'شركاء النجاح',
			p1: 'تشرفنا بالكثير من الشراكات القويّة مع مجموعة من الشركات المرموقة في جميع أنحاء المملكة، من هذه الشركات:'
		}
	},
	form: {
		fullName: 'الإسم:',
		fullNameError: 'الإسم يجب أن يكون أكثر من حرفين!',
		fullNameLengthError: 'الحد الأقصى للإسم 60 حرف!',
		fullNameNumericError: 'غير مسموح بالأرقام!',
		fullNamePlaceholder: 'أدخل اسمك هنا ...',
		email: 'البريد الإلكتروني:',
		emailError: 'من فضلك أدخل ايميل صحيح!',
		emailPlaceholder: 'أدخل عنوان البريد الإلكتروني ... (إختياري)',
		mobileNumber: 'رقم الجوال:',
		mobilePlaceholder: 'أدخل رقم الجوال ...',
		mobileError: 'من فضلك أدخل رقم جوال صحيح!',
		textArea: 'الرسالة:',
		textAreaPlaceholder: 'أكتب رسالتك هنا ...',
		textAreaError1: 'رسالتك قصيرة للغاية!',
		textAreaError2: 'الحد الأقصى للرسالة 500 حرف!',
		submit: 'إرســـال',
		successFeedback: 'أرسلت بنجاح!',
		errorFeedback: 'حدث خطأ ما!',
		notAllowedFeedback: 'من فضلك، نحتاج رقم جوال أو بريد الكتروني على الأقل!'
	}
};

export default en;
